# Total and Running Values

We have two tables. One table has all $ transactions from users during the month of March and one for the month of April.

Write a query that returns the total amount of money spent by each user. That is, the sum of the column transaction_amount for each user over both tables.

Write a query that returns day by day the cumulative sum of money spent by each user. That is, each day a user had a transcation, we should have how much money she has spent in total until that day. Obviously, the last day cumulative sum should match the numbers from the previous bullet point.

<img src="./example-data.png" width="100%">

In [2]:
import pandas as pd
march_txns = 'https://raw.githubusercontent.com/data-eng-10-21/interview-questions/main/ds-sql/3-total-and-running-values/query_four_march.csv'
april_txns = 'https://raw.githubusercontent.com/data-eng-10-21/interview-questions/main/ds-sql/3-total-and-running-values/query_four_april.csv'
march_txns = pd.read_csv(march_txns)
april_txns = pd.read_csv(april_txns)

In [4]:
import sqlite3
conn = sqlite3.connect('crm.db')

In [5]:
march_txns.to_sql('march_txns', conn)
april_txns.to_sql('april_txns', conn)

12000

In [6]:
pd.read_sql('select * from march_txns', conn)[:3]

   index  user_id        date  transaction_amount
0      0    13399  2015-03-01                  18
1      1    11934  2015-03-01                  63
2      2     3542  2015-03-01                  14

In [7]:
pd.read_sql('select * from april_txns', conn)[:3]

   index  user_id        date  transaction_amount
0      0    15895  2015-04-01                  66
1      1      271  2015-04-01                  55
2      2     4677  2015-04-01                  73

### Answer

<img src="./total.png" width="40%">

Or

<img src="./alt.png">